# parameters
nc: 20 # number of classes  
encode: 7
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple

# HRSC2016
# anchors:
#   - [39,16, 136,16, 168,23]  # P3/8
#   - [194,28, 208,36, 245,41]  # P4/16
#   - [303,46, 283,67, 370,92]  # P5/32

# FGSD2021
anchors:
  - [93,12, 73,16, 138,18]  # P3/8
  - [119,32, 160,24, 196,33]  # P4/16
  - [230,38, 268,58, 337,86]  # P5/32

# # dota-ship
# anchors:
#   - [19,8, 30,11, 36,13]  # P3/8
#   - [43,16, 54,19, 69,24]  # P4/16
#   - [100,33, 211,45, 457,89]  # P5/32


# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, BottleneckCSP, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, BottleneckCSP, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, BottleneckCSP, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, BottleneckCSP, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, BottleneckCSP, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors, encode]],  # Detect(P3, P4, P5)
  ]
